# Read and write CSV files with pandas DataFrames

You can load data from a CSV file directly into a pandas DataFrame

In [1]:
import pandas as pd

## Reading a CSV file into a pandas DataFrame
**read_csv** allows you to read the contents of a csv file into a DataFrame

airports.csv contains the following:  

Name,City,Country  
Seattle-Tacoma,Seattle,USA  
Dulles,Washington,USA  
Heathrow,London,United Kingdom  
Schiphol,Amsterdam,Netherlands  
Changi,Singapore,Singapore  
Pearson,Toronto,Canada  
Narita,Tokyo,Japan

In [3]:
airports_df = pd.read_csv('airports.csv')
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Handling rows with errors
By default rows with an extra , or other issues cause an error

Note the extra , in the row for Heathrow London in airportsInvalidRows.csv:  

Name,City,Country  
Seattle-Tacoma,Seattle,USA  
Dulles,Washington,USA  
Heathrow,London,,United Kingdom  
Schiphol,Amsterdam,Netherlands  
Changi,Singapore,Singapore  
Pearson,Toronto,Canada  
Narita,Tokyo,Japan

In [5]:
airports_df = pd.read_csv('airportsInvalidRows.csv', error_bad_lines=False)
airports_df

/home/goodman/.local/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3457: FutureWarning: The error_bad_lines argument has been deprecated and will be removed in a future version.


  exec(code_obj, self.user_global_ns, self.user_ns)
b'Skipping line 4: expected 3 fields, saw 4\n'

             Name        City      Country
0  Seattle-Tacoma     Seattle          USA
1          Dulles  Washington          USA
2        Schiphol   Amsterdam  Netherlands
3          Changi   Singapore    Singapore
4         Pearson     Toronto       Canada
5          Narita       Tokyo        Japan

Specify **error_bad_lines=False** to skip any rows with errors

In [4]:
airports_df = pd.read_csv(
                          'Data/airportsInvalidRows.csv', 
                           error_bad_lines=False
                           )
airports_df

b'Skipping line 4: expected 3 fields, saw 4\n'

             Name        City      Country
0  Seattle-Tacoma     Seattle          USA
1          Dulles  Washington          USA
2        Schiphol   Amsterdam  Netherlands
3          Changi   Singapore    Singapore
4         Pearson     Toronto       Canada
5          Narita       Tokyo        Japan

## Handling files which do not contain column headers
If your file does not have the column headers in the first row by default, the first row of data is treated as headers

airportsNoHeaderRows.csv contains airport data but does not have a row specifying the column headers:

Seattle-Tacoma,Seattle,USA  
Dulles,Washington,USA  
Heathrow,London,United Kingdom  
Schiphol,Amsterdam,Netherlands  
Changi,Singapore,Singapore  
Pearson,Toronto,Canada  
Narita,Tokyo,Japan

In [15]:
airports_df = pd.read_csv('airportsNoHeaderRows.csv',
                          header = None,
                          names=['Name', 'City', 'Country'])
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

Specify **header=None** if you do not have a Header row to avoid having the first row of data treated as a header row

In [16]:
airports_df = pd.read_csv(
                          'airportsNoHeaderRows.csv', 
                           header=None
                           )
airports_df

                0           1               2
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

If you do not have a header row you can use the **names** parameter to specify column names when data is loaded

In [18]:
airports_df = pd.read_csv(
                          'airportsNoHeaderRows.csv', 
                          header=None, 
                          names=("Name", "City", "Country")
                          )
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol   Amsterdam     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Missing values in Data files
Missing values appear in DataFrames as **NaN**

There is no city listed for Schiphol airport in airportsBlankValues.csv :

Name,City,Country  
Seattle-Tacoma,Seattle,USA  
Dulles,Washington,USA  
Heathrow,London,United Kingdom  
Schiphol,,Netherlands  
Changi,Singapore,Singapore  
Pearson,Toronto,Canada  
Narita,Tokyo,Japan

In [19]:
airports_df = pd.read_csv('airportsBlankValues.csv')
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol         NaN     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

## Writing DataFrame contents to a CSV file
**to_csv** will write the contents of a pandas DataFrame to a CSV file

In [20]:
airports_df

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3        Schiphol         NaN     Netherlands
4          Changi   Singapore       Singapore
5         Pearson     Toronto          Canada
6          Narita       Tokyo           Japan

In [22]:
airports_df.to_csv('Data/MyNewCSVFile.csv')

The index column is written to the csv file

Specify **index=False** if you do not want the index column to be included in the csv file

In [23]:
airports_df.to_csv(
                   'Data/MyNewCSVFileNoIndex.csv', 
#                     index=False
                    )

In [30]:
no_index_file = pd.read_csv("Data/MyNewCSVFileNoIndex.csv")

no_index_file

   Unnamed: 0            Name        City         Country
0           0  Seattle-Tacoma     Seattle             USA
1           1          Dulles  Washington             USA
2           2        Heathrow      London  United Kingdom
3           3        Schiphol         NaN     Netherlands
4           4          Changi   Singapore       Singapore
5           5         Pearson     Toronto          Canada
6           6          Narita       Tokyo           Japan

In [31]:
no_index_file.iloc[2]

Unnamed: 0                 2
Name                Heathrow
City                  London
Country       United Kingdom
Name: 2, dtype: object

In [34]:
no_index_file.iloc[0:2]

   Unnamed: 0            Name        City Country
0           0  Seattle-Tacoma     Seattle     USA
1           1          Dulles  Washington     USA

In [38]:
no_index_file.iloc[1:2, 1:]

     Name        City Country
1  Dulles  Washington     USA